ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263P/RL2_RL2_53212000h.xml
<module name="RL2" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="RL2_MOD_VER" acronym="RL2_MOD_VER" offset="0" width="32" description="The Module and Version Register identifies the module identifier and revision of the RL2 module.">
		<bitfield id="SCHEME" width="2" begin="31" end="30" resetval="0x1" description="Module Scheme" range="31:30" rwaccess="R"/>
	<bitfield id="BU" width="2" begin="29" end="28" resetval="0x2" description="Module Business Unit" range="29:28" rwaccess="R"/>
	<bitfield id="MODULE_ID" width="12" begin="27" end="16" resetval="0x2180" description="RL2 module ID." range="27:16" rwaccess="R"/>
	<bitfield id="RTL_VERSION" width="5" begin="15" end="11" resetval="0x3" description="RTL Version." range="15:11" rwaccess="R"/>
	<bitfield id="MAJOR_REVISION" width="3" begin="10" end="8" resetval="0x1" description="Major Revision." range="10:8" rwaccess="R"/>
	<bitfield id="CUSTOM_REVISION" width="2" begin="7" end="6" resetval="0x0" description="Custom Revision." range="7:6" rwaccess="R"/>
	<bitfield id="MINOR_REVISION" width="6" begin="5" end="0" resetval="0x0" description="Minor Revision." range="5:0" rwaccess="R"/>
	</register><register id="RL2_L2_CTRL" acronym="RL2_L2_CTRL" offset="4" width="32" description="The control register defines the size of the remote cache data storage memory to use and whether the L2 is enabled.">
		<bitfield id="ENABLE" width="1" begin="31" end="31" resetval="0x0" description="The enable field determines whether the L2 is enabled or not. Setting the enable from a 0 to 1 restarts the cache0:Disabled1:Enabled" range="31" rwaccess="R/W"/>
	<bitfield id="SIZE" width="3" begin="2" end="0" resetval="0x0" description="The size field determines the size of the remote cache data storage memory that is currently active. This field can be change dynamically, but will cause the entire cache to be invalidated when inflight transactions have completed. Changing the size while enable is already a '1' will restart the cache.0:8KB1:16KB2:32KB3:64KB4:128KB5:256KB (Dual Mode)Note: Setting this field to an invalid value will result in the field being set to '0'. The remote address range registers must be setup correctly to ensure it has sufficient memory for the selected size." range="2:0" rwaccess="R/W"/>
	</register><register id="RL2_L2_STS" acronym="RL2_L2_STS" offset="8" width="32" description="The Status register displays the state of the RL2 module.">
		<bitfield id="OK_TO_GO" width="1" begin="31" end="31" resetval="0x0" description="The ok_to_go status bit indicates the Tag/LRU Ram has been initialized and the cache is in an operable state." range="31" rwaccess="R"/>
	</register><register id="RL2_L2_LO" acronym="RL2_L2_LO" offset="16" width="32" description="The L2 Low address Least Significant word defines the least significant portion of the low cache address. The RL2 cache can cache a range of 1 to 16MB of cache as defined by L2_LO>=CachedRange&#60;=L2_HI. This register is write protected when enable is set.">
		<bitfield id="ADDRESS_LO_LSW" width="21" begin="31" end="11" resetval="0x0" description="The address_lo_lsw defines the L2 low address[31:11] for the RL2 to cache. The remaining bits 10:0 are assumed to be zero." range="31:11" rwaccess="R/W"/>
	</register><register id="RL2_L2_HI" acronym="RL2_L2_HI" offset="24" width="32" description="The L2 High address Least Significant word defines the least significant portion of the high cache address.  The RL2 cache can cache a range of 1 to 16MB of cache as defined by L2_LO>=CachedRange&#60;=L2_HI. This register is write protected when enable is set.">
		<bitfield id="ADDRESS_HI_LSW" width="21" begin="31" end="11" resetval="0x0" description="The address_hi_lsw defines the high address[31:11] for the RL2 to cache. The remaining bits 10:0 are assumed to be ones." range="31:11" rwaccess="R/W"/>
	</register><register id="RL2_L2HC" acronym="RL2_L2HC" offset="120" width="32" description="The L2 HIT Counter register holds the number of L2 Hits to the Remote data storage memory.">
		<bitfield id="HIT" width="32" begin="31" end="0" resetval="0x0" description="The hit Counts the number of hits to the L2 cache. Writing to this register will set the value written or restarting the cache will clear its contents. This field does not roll over, it will stop counting at all ones." range="31:0" rwaccess="R/W"/>
	</register><register id="RL2_L2MC" acronym="RL2_L2MC" offset="124" width="32" description="The L2 MISS Counter register holds the number of L2 Misses to the Remote data storage memory.">
		<bitfield id="MISS" width="32" begin="31" end="0" resetval="0x0" description="The miss Counts the number of misses to the L2 cache. Writing to this register will set the value written or restarting the cache will clear its contents. This field does not roll over, it will stop counting at all ones." range="31:0" rwaccess="R/W"/>
	</register><register id="RL2_IRQSTATUS_RAW" acronym="RL2_IRQSTATUS_RAW" offset="128" width="32" description="The Interrupt Raw Status Register holds the raw status of the FLC/RL2 status/error interrupts.">
		<bitfield id="FLC_DON" width="1" begin="4" end="4" resetval="0x0" description="The flc_don bit indicates a FLC has completed the transfer to the FLC range. Write 1 to set the flc_don status for diagnostic purposes. Writing a 0 has no effect." range="4" rwaccess="R/W1TS"/>
	<bitfield id="FLC_WRERR" width="1" begin="3" end="3" resetval="0x0" description="The flc_wrerr bit indicates a write error from FLC remote range has occurred and the FLC is logically disabled while this bit is a '1'. Write 1 to set the flc_wrerr status for diagnostic purposes. Writing a 0 has no effect." range="3" rwaccess="R/W1TS"/>
	<bitfield id="FLC_RDERR" width="1" begin="2" end="2" resetval="0x0" description="The flc_rderr bit indicates a read error from FLC range has occurred and the FLC is logically disabled while this bit is a '1'. Write 1 to set the flc_rderr status for diagnostic purposes. Writing a 0 has no effect." range="2" rwaccess="R/W1TS"/>
	<bitfield id="WR_HIT" width="1" begin="1" end="1" resetval="0x0" description="The wr_hit bit indicates a write to the cacheable range has occurred potentially causing a coherency issue and the RL2 is logically disabled while this bit is a '1'. Write 1 to set the wr_hit status for diagnostic purposes. Writing a 0 has no effect." range="1" rwaccess="R/W1TS"/>
	<bitfield id="WR_ERR" width="1" begin="0" end="0" resetval="0x0" description="The wr_err bit indicates a write error has occurred to the remote cache data storage memory and the RL2 is logically disabled while this bit is a '1'. Write 1 to set the wr_err status for diagnostic purposes. Writing a 0 has no effect." range="0" rwaccess="R/W1TS"/>
	</register><register id="RL2_IRQSTATUS_MSK" acronym="RL2_IRQSTATUS_MSK" offset="132" width="32" description="The Interrupt Masked Status Register holds the masked status for the FLC/RL2 status/error interrupts. Writing to this register will EOI the interrupt, that is if another interrupt is pending, a new pulse interrupt will be generated.">
		<bitfield id="FLC_DON" width="1" begin="4" end="4" resetval="0x0" description="The flc_don bit indicates a FLC has completed the transfer to the FLC range. Write 1 to clear the flc_don status after interrupt has been serviced (raw status gets cleared, i.e. even if not enabled). Writing a 0 has no effect to this field." range="4" rwaccess="R/W1TC"/>
	<bitfield id="FLC_WRERR" width="1" begin="3" end="3" resetval="0x0" description="The flc_wrerr bit indicates a write error from FLC range has occurred and the FLC is logically disabled while this bit is a '1'. Write 1 to clear the flc_wrerr status after interrupt has been serviced (raw status gets cleared, i.e. even if not enabled). Writing a 0 has no effect to this field." range="3" rwaccess="R/W1TC"/>
	<bitfield id="FLC_RDERR" width="1" begin="2" end="2" resetval="0x0" description="The flc_rderr bit indicates a read error from FLC range has occurred and the FLC is logically disabled while this bit is a '1'. Write 1 to clear the flc_rderr status after interrupt has been serviced (raw status gets cleared, i.e. even if not enabled). Writing a 0 has no effect to this field." range="2" rwaccess="R/W1TC"/>
	<bitfield id="WR_HIT" width="1" begin="1" end="1" resetval="0x0" description="The wr_hit bit indicates a write to the cacheable range has occurred potentially causing a coherency issue and the RL2 is logically disabled while this bit is a '1'. Write 1 to clear the wr_hit status after interrupt has been serviced (raw status gets cleared, i.e. even if not enabled). Writing a 0 has no effect to this field." range="1" rwaccess="R/W1TC"/>
	<bitfield id="WR_ERR" width="1" begin="0" end="0" resetval="0x0" description="The wr_err bit indicates a write error has occurred to the remote cache data storage memory and the RL2 is logically disabled while this bit is a '1'. Write 1 to clear the wr_err status after interrupt has been serviced (raw status gets cleared, i.e. even if not enabled). Writing a 0 has no effect to this field." range="0" rwaccess="R/W1TC"/>
	</register><register id="RL2_IRQENABLE_SET" acronym="RL2_IRQENABLE_SET" offset="136" width="32" description="The Interrupt Enable Set Register holds the interrupt enable status of the FLC/RL2 status/error interrupts.">
		<bitfield id="EN_FLC_DON" width="1" begin="4" end="4" resetval="0x0" description="Interrupt Enable Set for en_flc_don status bit. Writing a 1 will enable the interrupt, and set this bit as well as the corresponding Interrupt Enable Clear Register. Writing a 0 has no effect." range="4" rwaccess="R/W1TS"/>
	<bitfield id="EN_FLC_WRERR" width="1" begin="3" end="3" resetval="0x0" description="Interrupt Enable Set for en_flc_wrerr error bit. Writing a 1 will enable the interrupt, and set this bit as well as the corresponding Interrupt Enable Clear Register. Writing a 0 has no effect." range="3" rwaccess="R/W1TS"/>
	<bitfield id="EN_FLC_RDERR" width="1" begin="2" end="2" resetval="0x0" description="Interrupt Enable Set for en_flc_rderr error bit. Writing a 1 will enable the interrupt, and set this bit as well as the corresponding Interrupt Enable Clear Register. Writing a 0 has no effect." range="2" rwaccess="R/W1TS"/>
	<bitfield id="EN_WR_HIT" width="1" begin="1" end="1" resetval="0x0" description="Interrupt Enable Set for wr_hit error bit. Writing a 1 will enable the interrupt, and set this bit as well as the corresponding Interrupt Enable Clear Register. Writing a 0 has no effect." range="1" rwaccess="R/W1TS"/>
	<bitfield id="EN_WR_ERR" width="1" begin="0" end="0" resetval="0x0" description="Interrupt Enable Set for wr_err error bit. Writing a 1 will enable the interrupt, and set this bit as well as the corresponding Interrupt Enable Clear Register. Writing a 0 has no effect." range="0" rwaccess="R/W1TS"/>
	</register><register id="RL2_IRQENABLE_CLR" acronym="RL2_IRQENABLE_CLR" offset="140" width="32" description="The Interrupt Enable Clear Register holds the interrupt enable status of the FLC/RL2 status/error interrupts.">
		<bitfield id="EN_FLC_DON" width="1" begin="4" end="4" resetval="0x0" description="Interrupt Enable Clear for flc_don status bit. Writing a 1 will disable the interrupt, and clear this bit as well as the corresponding Interrupt Enable Set Register. Writing a 0 has no effect." range="4" rwaccess="R/W1TC"/>
	<bitfield id="EN_FLC_WRERR" width="1" begin="3" end="3" resetval="0x0" description="Interrupt Enable Clear for flc_wrerr error bit. Writing a 1 will disable the interrupt, and clear this bit as well as the corresponding Interrupt Enable Set Register. Writing a 0 has no effect." range="3" rwaccess="R/W1TC"/>
	<bitfield id="EN_FLC_RDERR" width="1" begin="2" end="2" resetval="0x0" description="Interrupt Enable Clear for flc_rderr error bit. Writing a 1 will disable the interrupt, and clear this bit as well as the corresponding Interrupt Enable Set Register. Writing a 0 has no effect." range="2" rwaccess="R/W1TC"/>
	<bitfield id="EN_WR_HIT" width="1" begin="1" end="1" resetval="0x0" description="Interrupt Enable Clear for wr_hit error bit. Writing a 1 will disable the interrupt, and clear this bit as well as the corresponding Interrupt Enable Set Register. Writing a 0 has no effect." range="1" rwaccess="R/W1TC"/>
	<bitfield id="EN_WR_ERR" width="1" begin="0" end="0" resetval="0x0" description="Interrupt Enable Clear for wr_err error bit. Writing a 1 will disable the interrupt, and clear this bit as well as the corresponding Interrupt Enable Set Register. Writing a 0 has no effect." range="0" rwaccess="R/W1TC"/>
	</register><register id="RL2_FLC_CFG" acronym="RL2_FLC_CFG" offset="260" width="32" description="The FLC Config Register contains the configuration values for the FLC.">
		<bitfield id="FIFO_BYPASS" width="1" begin="31" end="31" resetval="0x0" description="Setting this bit will cause the write to remote memory for a cache miss or FLC return to forces stalls on the read returns if any other data phase for a cache miss or FLC return is received. This can cause stalls on the write to force stalls on the read." range="31" rwaccess="R/W"/>
	<bitfield id="FLC_EXCNT" width="3" begin="26" end="24" resetval="0x0" description="The number of extra requests the FLC can send. The maximum value is 4 anything greater will default to 4. This value + 1 is the number of Reassembly Buffers used for FLC so if cache misses needed to be supported this value should be set to 4 or lower. The number of cache misses that will be allowed to be outstanding while FLC is running will be 5 - (FLC_EXCNT + 1)." range="26:24" rwaccess="R/W"/>
	<bitfield id="ASMNUM" width="8" begin="15" end="8" resetval="0x5" description="Number of Reassembly Buffer supported" range="15:8" rwaccess="R"/>
	<bitfield id="RANGES" width="8" begin="7" end="0" resetval="0x4" description="Number of FLC ranges supported" range="7:0" rwaccess="R"/>
	</register><register id="RL2_FLC_STS" acronym="RL2_FLC_STS" offset="264" width="32" description="The FLC Status Register will indicate the state of the FLC completion.">
		<bitfield id="CPYCMP" width="4" begin="3" end="0" resetval="0x0" description="The cpycmp indicates which FLC range is complete. Each bit index indicates the FLC range is complete." range="3:0" rwaccess="R"/>
	</register><register id="RL2_FLC_DBG0" acronym="RL2_FLC_DBG0" offset="272" width="32" description="The FLC Debug 0 Register holds the debug state of the FLC. ">
		<bitfield id="FLCIF" width="1" begin="31" end="31" resetval="0x0" description="The flcif indicates a FLC operation is in flight." range="31" rwaccess="R"/>
	<bitfield id="FLC_OUT_CNT" width="3" begin="26" end="24" resetval="0x0" description="The number of read requests the FLC operation has in flight." range="26:24" rwaccess="R"/>
	<bitfield id="CURFLC" width="2" begin="1" end="0" resetval="0x0" description="The curflc indicates which FLC range is in flight." range="1:0" rwaccess="R"/>
	</register><register id="RL2_FLC_DBG1" acronym="RL2_FLC_DBG1" offset="276" width="32" description="The FLC Debug 1 Register holds the debug address of the FLC.">
		<bitfield id="FLCADR" width="32" begin="31" end="0" resetval="0x0" description="The flcadr indicates the next FLC address to be processed if still in flight. That is all addresses less than this address have been transferred. This address is used for FLC hit when the particular FLC range is in flight. That is FLC_LO>=FLCrange&#60;flc_dbg1.flcadr would result in a hit. This address will match the last FLC transferred FLC_HI when no FLC ranges are in flight." range="31:0" rwaccess="R"/>
	</register><register id="RL2_RAT_CFG" acronym="RL2_RAT_CFG" offset="516" width="32" description="The RAT Config Register contains the configuration values for the RAT.">
		<bitfield id="ADDR_WIDTH" width="8" begin="23" end="16" resetval="0x32" description="Number of address bits" range="23:16" rwaccess="R"/>
	<bitfield id="REGIONS" width="8" begin="7" end="0" resetval="0x4" description="Number of regions" range="7:0" rwaccess="R"/>
	</register><register id="RL2_REM_ADR_j" acronym="RL2_REM_ADR_j" offset="32" width="32" description="The REMote 'n' Address Least Significant word defines the least significant portion of the Remote address for remote cache data storage memory 0.  The RL2 cache use up to three remote cache data storage memory ranges to place the L2 data within. The length of these ranges must be greater or equal to the size specified. This register is write protected when enable is set.">
		<bitfield id="ADR_LSW" width="21" begin="31" end="11" resetval="0x0" description="The rem0_adr_lsw defines the LSW of the remote cache data storage memory address[31:11] range 'n' for the RL2 to use for the cache. The remaining bits 10:0 are assumed to be zero." range="31:11" rwaccess="R/W"/>
	</register><register id="RL2_REM_LEN_j" acronym="RL2_REM_LEN_j" offset="40" width="32" description="The Remote 'n' length defines the amount of remote cache data storage memory in 64 byte aligned quanta used starting from the REMote 'n' Address. The RL2 consumes remote cache data storage memory ranges in numeric order. Range 0 is consumed prior to range 1, etc. This register is write protected when enable is set.">
		<bitfield id="LEN" width="13" begin="18" end="6" resetval="0x0" description="The rem0_len field specifies the length of the remote cache data storage memory 'n' to use for the RL2 cache in 64 byte quanta, That is the number of bytes specified in the remote cache data storage memory range 'n' is (rem0_len X 64).  Note: Any value greater than 4096 assumes 4096" range="18:6" rwaccess="R/W"/>
	</register><register id="RL2_FLC_LO_j" acronym="RL2_FLC_LO_j" offset="288" width="32" description="The FLC Low 'n' address defines the FLC lo address for FLC range 0. The FLC range is defined by FLC_LO0>=FLCrange&#60;FLC_HI0. This register is write protected when fenable0 is set.">
		<bitfield id="ADR_LO" width="20" begin="31" end="12" resetval="0x0" description="The adr0_lo defines the FLC low address[31:12] for the FLC to copy. The remaining bits 11:0 are assumed to be zero." range="31:12" rwaccess="R/W"/>
	</register><register id="RL2_FLC_HI_j" acronym="RL2_FLC_HI_j" offset="296" width="32" description="The FLC High 'n' address defines the FLC high address for FLC range 0. The FLC range is defined by FLC_LO0>=FLCrange&#60;FLC_HI0. This register is write protected when fenable0 is set.">
		<bitfield id="ADR_HI" width="20" begin="31" end="12" resetval="0x0" description="The adr0_hi defines the FLC high address[31:12] for the FLC to copy. The remaining bits 11:0 are assumed to be ones." range="31:12" rwaccess="R/W"/>
	</register><register id="RL2_FLC_RA_j" acronym="RL2_FLC_RA_j" offset="304" width="32" description="The FLC Remote Address 'n' specifies the SRAM location base address the FLC will copy slow Flash data to the SRAM. That is the SRAM is acting like a block cacke for a slow device.">
		<bitfield id="RADR" width="20" begin="31" end="12" resetval="0x0" description="The radr0 specifies the remote SRAM address for FLC data to be copied. The SRAM must be large enough for the specified range." range="31:12" rwaccess="R/W"/>
	</register><register id="RL2_FLC_CTL_j" acronym="RL2_FLC_CTL_j" offset="312" width="32" description="The FLC Control 'n' enables the given range FLC_LO0>=FLCrange&#60;FLC_HI0 to be copied to the FLC_RA0 SRAM memory.">
		<bitfield id="FENABLE" width="1" begin="31" end="31" resetval="0x0" description="The fenable0 enables the FLC_LO0>=FLCrange&#60;FLC_HI0 to be copied. if the fenable0 is set to zero, the range is disabled and commands forwarded directly without change." range="31" rwaccess="R/W"/>
	<bitfield id="FCOPIED" width="1" begin="28" end="28" resetval="0x0" description="The fcopied0 bit indicates the FLC range has already been copied to the radr0 address so a transfer is not required. Setting this bit at the same cycle or prior to setting the fenable will prevent the FLC transfer but enable the mapping." range="28" rwaccess="R/W"/>
	</register><register id="RL2_RAT_CTL_j" acronym="RL2_RAT_CTL_j" offset="544" width="32" description="The Control for Region 0">
		<bitfield id="REN" width="1" begin="31" end="31" resetval="0x0" description="Enable for the Region" range="31" rwaccess="R/W"/>
	<bitfield id="SIZE" width="6" begin="5" end="0" resetval="0x0" description="Size of the Region in Address Bits. 0-12 = 4K byte, 13 = 8KB, 14 = 16KB, 15 = 32KB, etc. up to 32-63 = 4GB." range="5:0" rwaccess="R/W"/>
	</register><register id="RL2_RAT_RBA_j" acronym="RL2_RAT_RBA_j" offset="548" width="32" description="The Base Address for Region 0. This is the source address for matching to a region.">
		<bitfield id="BASE" width="32" begin="31" end="0" resetval="0x0" description="Base Address for the Region. It must be aligned to the programmed size." range="31:0" rwaccess="R/W"/>
	</register><register id="RL2_RAT_RTA_j" acronym="RL2_RAT_RTA_j" offset="552" width="32" description="The Translated Address Bits for Region 0">
		<bitfield id="TRANS" width="32" begin="31" end="0" resetval="0x0" description="Translated Address Bits for the Region. It must be aligned to the programmed size." range="31:0" rwaccess="R/W"/>
	</register>
</module>